OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/src/stm8l15x_adc.c
  /*clear CR2 register */
  ADCx->CR2 &= (uint8_t)~(ADC_CR2_PRESC);

  /* set the Prescaler */
  ADCx->CR2 |= (uint8_t) ADC_Prescaler;
}

/**
  * @brief  Enables or disables the selected ADC peripheral.
  * @param  ADCx where x can be 1 to select the specified ADC peripheral.
  * @param  NewState : new state of the specified ADC peripheral.
    *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_Cmd(ADC_TypeDef* ADCx,
             FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the ADON bit to wake up the specified ADC from power down mode */
    ADCx->CR1 |= ADC_CR1_ADON;
  }
  else
  {
    /* Disable the selected ADC peripheral */
    ADCx->CR1 &= (uint8_t)~ADC_CR1_ADON;
  }
}

/**
  * @brief  Starts ADC conversion, by software trigger.
  * @param  ADCx where x can be 1 to select the specified ADC peripheral.
  * @retval None
  */
void ADC_SoftwareStartConv(ADC_TypeDef* ADCx)
{
  /*  Start the ADC software conversion */
  ADCx->CR1 |= ADC_CR1_START;
}

/**
  * @brief  Configures the ADC conversion through external trigger.
  * @param  ADCx where x can be 1 to select the specified ADC peripheral.
  * @param  ADC_ExtEventSelection : Specifies the external trigger.
  *          This parameter can be one of the following values:
  *            @arg ADC_ExtEventSelection_None: Conversion starts only by software start
  *            @arg ADC_ExtEventSelection_Trigger1: Trigger 1  Enables conversion
  *            @arg ADC_ExtEventSelection_Trigger2: Trigger 2  Enables conversion
  *            @arg ADC_ExtEventSelection_Trigger3: Trigger 3  Enables conversion      
  * @param  ADC_ExtTRGSensitivity : Specifies the external trigger sensitivity.
  *          This parameter can be one of the following values:
  *            @arg ADC_ExtTRGSensitivity_Rising: External Trigger Sensitivity is Rising Edge
  *            @arg ADC_ExtTRGSensitivity_Falling: External Trigger Sensitivity is Falling Edge
  *            @arg ADC_ExtTRGSensitivity_All: External Trigger Sensitivity is Falling and Rising Edge
  * @retval None
  */
void ADC_ExternalTrigConfig(ADC_TypeDef* ADCx,
                            ADC_ExtEventSelection_TypeDef ADC_ExtEventSelection,
                            ADC_ExtTRGSensitivity_TypeDef ADC_ExtTRGSensitivity)
{
  /* Check the parameters */
  assert_param(IS_ADC_EXT_EVENT_SELECTION(ADC_ExtEventSelection));
  assert_param(IS_ADC_EXT_TRG_SENSITIVITY(ADC_ExtTRGSensitivity));

  /*clear old configuration of CR2 register */
  ADCx->CR2 &= (uint8_t)~(ADC_CR2_TRIGEDGE | ADC_CR2_EXTSEL);

  /* set the External Trigger Edge Sensitivity  and the external event 
     selection */
  ADCx->CR2 |= (uint8_t)( (uint8_t)ADC_ExtTRGSensitivity | \
                          (uint8_t)ADC_ExtEventSelection);
}

 /**
  * @}
  */

/** @defgroup ADC_Group2 Analog Watchdog configuration functions
 *  @brief   Analog Watchdog configuration functions 
 *
@verbatim   
 ===============================================================================
                    Analog Watchdog configuration functions
 ===============================================================================  

  This section provides functions allowing to configure the Analog Watchdog
  (AWD) feature in the ADC.
  
  A typical configuration Analog Watchdog is done following these steps :
   1. the ADC guarded channel is selected using the 
      ADC_AnalogWatchdogChannelSelect() function.
   2. The Analog watchdog lower and higher threshold are configured using the  
      ADC_AnalogWatchdogThresholdsConfig() function.
   
   Note : Both AWD selection and thresholds can be configured with one unique 
          function ADC_AnalogWatchdogConfig(), which is kept for firmware 
          compatibility reason.

@endverbatim
  * @{
  */
/**
  * @brief  Configures the channel to be checked by the Analog watchdog.
  * @param  ADCx where x can be 1 to select the specified ADC peripheral.
  * @param  ADC_AnalogWatchdogSelection : Specifies the channel to be checked 
  *         by the Analog watchdog.
  *          This parameter can be one of the following values:
  *            @arg ADC_AnalogWatchdogSelection_Channel0: AWD affected to Channel 0
  *            @arg ADC_AnalogWatchdogSelection_Channel1: AWD affected to Channel 1
  *            @arg ADC_AnalogWatchdogSelection_Channel2: AWD affected to Channel 2
  *            @arg ADC_AnalogWatchdogSelection_Channel3: AWD affected to Channel 3
  *            @arg ADC_AnalogWatchdogSelection_Channel4: AWD affected to Channel 4
  *            @arg ADC_AnalogWatchdogSelection_Channel5: AWD affected to Channel 5
  *            @arg ADC_AnalogWatchdogSelection_Channel6: AWD affected to Channel 6
  *            @arg ADC_AnalogWatchdogSelection_Channel7: AWD affected to Channel 7
  *            @arg ADC_AnalogWatchdogSelection_Channel8: AWD affected to Channel 8
  *            @arg ADC_AnalogWatchdogSelection_Channel9: AWD affected to Channel 9
  *            @arg ADC_AnalogWatchdogSelection_Channel10: AWD affected to Channel 10
  *            @arg ADC_AnalogWatchdogSelection_Channel11: AWD affected to Channel 11
  *            @arg ADC_AnalogWatchdogSelection_Channel12: AWD affected to Channel 12
  *            @arg ADC_AnalogWatchdogSelection_Channel13: AWD affected to Channel 13
  *            @arg ADC_AnalogWatchdogSelection_Channel14: AWD affected to Channel 14
  *            @arg ADC_AnalogWatchdogSelection_Channel15: AWD affected to Channel 15
  *            @arg ADC_AnalogWatchdogSelection_Channel16: AWD affected to Channel 16
  *            @arg ADC_AnalogWatchdogSelection_Channel17: AWD affected to Channel 17
  *            @arg ADC_AnalogWatchdogSelection_Channel18: AWD affected to Channel 18
  *            @arg ADC_AnalogWatchdogSelection_Channel19: AWD affected to Channel 19
  *            @arg ADC_AnalogWatchdogSelection_Channel20: AWD affected to Channel 20
  *            @arg ADC_AnalogWatchdogSelection_Channel21: AWD affected to Channel 21
  *            @arg ADC_AnalogWatchdogSelection_Channel22: AWD affected to Channel 22
  *            @arg ADC_AnalogWatchdogSelection_Channel23: AWD affected to Channel 23
  *         @ref ADC_AnalogWatchdogSelection_TypeDef enumeration.
  * @retval None
  */
void ADC_AnalogWatchdogChannelSelect(ADC_TypeDef* ADCx,
                                     ADC_AnalogWatchdogSelection_TypeDef ADC_AnalogWatchdogSelection)
{
  /* Check the parameters */
  assert_param(IS_ADC_ANALOGWATCHDOG_SELECTION(ADC_AnalogWatchdogSelection));

  /* Reset the CHSEL bits */
  ADCx->CR3 &= ((uint8_t)~ADC_CR3_CHSEL);

